Revit 2027 API
StructuralSectionStructuralTees.BoltSpacingWeb Property
 Standard bolt spacing in the web, in. (mm)
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double BoltSpacingWeb { get; set; }
Public Property BoltSpacingWeb As Double
	Get
	Set
public:
property double BoltSpacingWeb {
	double get ();
	void set (double value);
}
member BoltSpacingWeb : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionStructuralTees Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace